DELIMITER @@

CREATE PROCEDURE `prc_LoadSampleData`()
BEGIN

INSERT INTO `productkind` (`Kind`) VALUES
('Очки'),
('Линзы'),
('Чехлы'),
('Тряпки'),
('Спреи');

INSERT INTO `orderstatus` (`Text`) VALUES
('Изготовление'),
('Выдан');

INSERT INTO `routeliststatus` (`Status`) VALUES
('Создан'),
('В пути'),
('Доставлен');

INSERT INTO `deliveryeventtype` (`Name`) VALUES
('Отправлен'),
('Получен');

INSERT INTO `production`
(`Productor`,`Count`,`Price`,`Article`,`Description`,`Kind`,`Name`,`GlassType`,`Properties`)
VALUES
('Ray Ban',15,10500,'ПР-Оч-000000001','Оправа Horizontal',1,'Horizontal','',''),
('Ray Ban',10,11000,'ПР-Оч-000000002','Оправа Vertical',1,'Vertical','',''),
('Boss',14,12000,'ПР-Оч-000000003','Оправа GH-120',1,'GH-120','',''),
('Boss',10,11500,'ПР-Оч-000000004','Оправа GL-150',1,'GL-150','',''),

('',10,250,'ПР-Дп-000000001','Строгий кожаный чехол',3,'Чехол кожаный','',''),
('',5,225,'ПР-Дп-000000002','Блестящий металлический чехол',3,'Чехол металлический','',''),
('',50,180,'ПР-Дп-000000003','Тряпка для линз',4,'Тряпка','',''),
('FreeSeen',58,320,'ПР-Дп-000000004','Спрей от царапин',5,'Спрей','',''),

('FreeSeen',40,1200,'ПР-Лз-000000001','Простые линзы',2,'','Обыкновенное','Южная Корея'),
('Южная Корея',44,2100,'ПР-Лз-000000002','Антибликовое',2,'','Для работы',''),
('FreeSeen',42,2050,'ПР-Лз-000000003','Анти UV',2,'','Для прогулок',''),
('YakitoGlass',20,4000,'ПР-Лз-000000004','Хамелеоны',2,'','Универсальное','Япония');

INSERT INTO `users`
(`Login`,`Password`,`FirstName`,`LastName`,`MiddleName`)
VALUES
('wk_IvanovII','Pa$$w0rd','Иван','Иванов','Иванович'),
('wk_PetrovPP','Pa$$w0rd','Пётр','Петров','Петрович'),
('wk_ZakharovZZ','Pa$$w0rd','Захар','Захаров','Захарович'),
('wk_AlekseevAA','Pa$$w0rd','Алексей','Алексеев','Алексеевич'),
('LeonidovaSD','Pa$$w0rd','София','Леонидова','Дмитриевна'),
('ValdovRU','Pa$$w0rd','Роман','Владов','Юрьевич'),
('IgorevAA','Pa$$w0rd','Андрей','Игорев','Александрович'),
('MihailovMA','Pa$$w0rd','Максим','Михаилов','Андреевич');

INSERT INTO `employees` (`User`,`JobTitle`) VALUES
(1,'Работа с поставщиками'),
(2,'Продавец-консультант'),
(3,'Продавец-консультант'),
(4,'Продавец-консультант');

INSERT INTO `clients`
(`User`,`PassportSeries`,`PassportNumber`,`PhoneNumber`,`Email`)
VALUES
(5,4356,257544,'+79633680856','leonidova_s_d@ya.ru'),
(6,4586,228752,'+79732578621','vladov_r_u@gmail.com'),
(7,4578,158834,'+79787338990','igorev_a_a@ya.ru'),
(8,4752,773277,'+79267838213','mihailov_m_a@ya.ru');

INSERT INTO `suppliers` (`Name`,`OKPO`,`Address`) VALUES
('ООО ЗренСвет','5222267216','Москва Бибирево 52'),
('ООО ЛизТорг','6677322537','Москва Белорусская 28'),
('НАПО ЛинзПром','5222267216','Москва Октябрьская 3'),
('НПАО АксессПрод','4902561683','Москва Сухаревская 63');

INSERT INTO `contracts`
(`FormDate`,`Till`,`Supplier`)
VALUES
('2020-04-02','2025-04-02',1),
('2020-06-11','2025-06-11',2),
('2021-06-28','2026-06-28',3),
('2022-10-09','2027-10-09',4);

INSERT INTO `bids`
(`Contract`,`Date`,`Employee`)
VALUES
(1,'2023-08-10',1),
(2,'2023-08-16',1),
(1,'2023-08-27',1),
(2,'2023-09-05',1),
(3,'2023-09-14',1),
(3,'2023-09-26',1);

INSERT INTO `production_bid`
(`Production`,`Bid`,`Count`)
VALUES
(1,1,4),
(2,1,4),
(4,1,6),
(9,2,6),
(10,2,3),
(1,3,10),
(9,4,5),
(10,4,10),
(1,4,4),
(11,5,10),
(12,5,5),
(7,6,10);

INSERT INTO `orders`
(`Client`,`Receipt`,`DateTime`,`Glasses`,`Linzes`,`CreationDate`,`Employee`,`Status`,`Check`,`PaymentType`,`InputMoney`,`Payback`)
VALUES
(1,'-3/-3.1 54мм','2023-08-21',3,10,'2023-09-01',2,2,'КЧоп/23-00000001',1,16920,0),
(3,'+2/+2.5 50мм','2023-08-23',1,11,'2023-09-15',1,1,'',1,17376,0),
(2,'+1.5/+1.2 51мм','2023-08-23',1,12,'2023-09-04',2,2,'КЧоп/23-00000002',2,20000,200),
(4,'+1.1/+3 52мм','2023-08-30',4,10,'2023-09-04',3,2,'КЧоп/23-00000003',1,16320,0),
(2,'+1.5/+1.2 51мм','2023-08-30',2,11,'2023-09-05',4,2,'КЧоп/23-00000004',1,15660,0);

INSERT INTO `additionalservices`
(`Order`,`Product`)
VALUES
(2,5),
(2,7),
(3,7),
(3,8);

END @@

DELIMITER ;
